conf/src/InformationRegisters/ВерсииПатчей/ВерсииПатчей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВерсииПатчей</name>
  <resources>
    <name>НачальнаяСборка</name>
    <type>
      <types>CatalogRef.СборкиВерсии</types>
    </type>
  </resources>
  <resources>
    <name>КонечнаяСборка</name>
    <type>
      <types>CatalogRef.СборкиВерсии</types>
    </type>
  </resources>
  <resources>
    <name>ДатаИсправления</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДанныеПатча</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СтатусыПатчей</types>
    </type>
  </resources>
  <resources>
    <name>КонечнаяСборкаПоХранилищу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ИзменяемыеМетаданные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПубликации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Параметры</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОшибкиПересчетаПрименимости</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанДляКонфигурации</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтзыва</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимСовместимости</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПатча</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Патч</name>
    <type>
      <types>CatalogRef.Патчи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Версия</name>
    <type>
      <types>CatalogRef.ВерсииПроекта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ошибка</name>
    <type>
      <types>CatalogRef.Ошибки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/Enums/СтатусыПатчей/СтатусыПатчей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПатчей</name>
  <enumValues>
    <name>ОжиданиеИсправления</name>
  </enumValues>
  <enumValues>
    <name>СозданНеПроверен</name>
  </enumValues>
  <enumValues>
    <name>СозданПроверен</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетПубликации</name>
  </enumValues>
  <enumValues>
    <name>Публикуется</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаПубликации</name>
  </enumValues>
  <enumValues>
    <name>Опубликован</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Отозван</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОтзыва</name>
  </enumValues>
  <enumValues>
    <name>ОпубликованОбновлениеПрименимости</name>
  </enumValues>
  <enumValues>
    <name>СозданиеПатча</name>
  </enumValues>
  <enumValues>
    <name>ПатчНеТребуется</name>
  </enumValues>
  <enumValues>
    <name>СозданиеВручную</name>
  </enumValues>
</mdclass:Enum>

conf/src/Catalogs/ВерсииПроекта/ВерсииПроекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВерсииПроекта</name>
  <owners>Catalog.Проекты</owners>
  <attributes>
    <name>ВерсияМеханизмаОбновленияИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформыХранилища</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ветка</name>
    <type>
      <types>CatalogRef.Ветки</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВключенияБиблиотек</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаГотовностиКПредварительномуВстраиванию</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаВнешнегоТестирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРазработки</name>
    <comment>Начало разработки</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРазработки</name>
    <comment>Окончание разработки</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПредстоящейСборки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрекращенияПоддержки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяИБДляЗагрузкиМетаданных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяХранилищаДляЗагрузкиМетаданных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогИБДляЗагрузкиМетаданных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВерсии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПодредакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерРедакции</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбновлятьКонфигурациюИзХранилищаПриЗагрузкеМетаданных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователяИБДляЗагрузкиМетаданных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователяХранилищаДляЗагрузкиМетаданных</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаВыпуска</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПубликуемыйНомерВерсии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьПатчи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВерсииВключаемыхПроектов</name>
    <attributes>
      <name>Версия</name>
      <type>
        <types>CatalogRef.ВерсииПроекта</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтличияВИменахМетаданных</name>
    <attributes>
      <name>ОбъектМетаданных</name>
      <type>
        <types>CatalogRef.ОбъектыМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>ПолноеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтличияВСоставеПодсистем</name>
    <attributes>
      <name>Подсистема</name>
      <type>
        <types>CatalogRef.Подсистемы</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектМетаданных</name>
      <type>
        <types>CatalogRef.ОбъектыМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектНужноДобавитьВПодсистему</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

conf/src/InformationRegisters/ВерсииПатчей/Forms/ФормаЗаписи/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Заголовок = НСтр("ru = 'Версия патча ""%1""'");
	Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Заголовок, Запись.Патч);
	Элементы.Подтвердить.Доступность = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.ВерсииПатчей);
	Элементы.Пересоздать.Видимость = (Запись.Состояние = Перечисления.СтатусыПатчей.СозданПроверен
		Или Запись.Состояние = Перечисления.СтатусыПатчей.СозданНеПроверен
		Или Запись.Состояние = Перечисления.СтатусыПатчей.Ошибка
		Или Запись.Состояние = Перечисления.СтатусыПатчей.СозданиеПатча
		Или Запись.Состояние = Перечисления.СтатусыПатчей.СозданиеВручную);
	
	Проект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Патч, "Владелец");
	
	Если Не ЗначениеЗаполнено(Запись.ПодписанДляКонфигурации) Тогда
		Элементы.ПодписанДляКонфигурации.Видимость = Ложь;
	КонецЕсли;
	
	ВключенаПубликация = ПолучитьФункциональнуюОпцию("ИспользоватьПубликациюПатчейВСервисе");
	Если Не ВключенаПубликация Тогда
		Элементы.Подтвердить.Заголовок = НСтр("ru = 'Патч проверен'");
	КонецЕсли;
	
	КонечнаяСборкаПоХранилищу = Запись.КонечнаяСборкаПоХранилищу;
	Если Не ЗначениеЗаполнено(КонечнаяСборкаПоХранилищу) Тогда
		КонечнаяСборкаПоХранилищу = НСтр("ru = 'не рассчитана'")
	КонецЕсли;
	ТекстКонечнаяСборка = НСтр("ru = 'Конечная сборка, рассчитанная по хранилищу конфигурации - %1.'");
	ТекстКонечнаяСборка = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстКонечнаяСборка, КонечнаяСборкаПоХранилищу);
	Элементы.КонечнаяСборка.Подсказка = Элементы.КонечнаяСборка.Подсказка + Символы.ПС + ТекстКонечнаяСборка
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ОбновитьВидимостьЭлементовФормы();
	
	ЗаписьРегистра = РеквизитФормыВЗначение("Запись");
	ПараметрыПатча = ПоместитьВоВременноеХранилище(ЗаписьРегистра.Параметры, УникальныйИдентификатор);
	
	ЛогДействийСПатчем = СтрСоединить(ЗаписьРегистра.Параметры.Получить().Лог, Символы.ПС);
	ЛогОшибок = ЗаписьРегистра.Параметры.Получить().ЛогОшибок;
	
	КоличествоОшибок = ЛогОшибок.Количество();
	Если КоличествоОшибок > 0 Тогда
		КоличествоОшибок = КоличествоОшибок / 3;
	КонецЕсли;
	Элементы.ПосмотретьЛогОшибок.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		Элементы.ПосмотретьЛогОшибок.Заголовок,
		КоличествоОшибок);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Патчи_РучноеСоздание" Тогда
		Закрыть();
	КонецЕсли;
	Если ИмяСобытия = "Патчи_ИзменениеСтатуса" Тогда
		Прочитать();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПосмотретьЛогОшибокНажатие(Элемент)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПараметрыПатча", ПараметрыПатча);
	ОткрытьФорму("РегистрСведений.ВерсииПатчей.Форма.ПросмотрОшибок", ПараметрыФормы);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьПатч(Команда)
	ИнформацияОПатче = ИнформацияОПатче();
	ПолучитьФайл(ИнформацияОПатче.ДанныеПатча, ИнформацияОПатче.ИмяПатча, Истина);
КонецПроцедуры

&НаКлиенте
Процедура Подтвердить(Команда)
	Если ВключенаПубликация Тогда
		ТекстВопроса = "Проверка патча осуществляется:
			|• в опубликованной версии конфигурации (библиотеки) – сначала убедиться, что ошибка воспроизводится;
			|• затем установить патч и убедиться, что ошибка исправлена.
			|
			|Не следует полагаться только на успешное подключение патча к конфигурации, или что патч успешно собран автоматически.
			|Проверка патча обязательна в полном объеме.
			|
			|Если проверка требует регламентного тестирования (например, обязательно подтверждение исправления ночными тестами и т.п.), то патч не следует публиковать до того, как исправление ошибки пройдет все предусмотренные этапы проверки.
			|
			|После проверки патч автоматически будет отправлен на публикацию.";
	Иначе
		ТекстВопроса = НСтр("ru = 'Установить признак проверки патча?'");
	КонецЕсли;
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодтвердитьПроверкуПатча", ЭтотОбъект);
	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("ПатчПроверен", НСтр("ru = 'Патч проверен'"));
	Кнопки.Добавить("Отмена", НСтр("ru = 'Отмена'"));
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, Кнопки, , "Отмена");
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепитьПатч(Команда)
	
	Если Запись.Состояние = ПредопределенноеЗначение("Перечисление.СтатусыПатчей.ОжиданиеИсправления") Тогда
		ТекстВопроса = НСтр("ru = 'Автоматическое создание будет отключено.
			|Включить его обратно можно по команде Пересоздать
			|в подменю Еще.
			|
			|Продолжить?'");
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПрикрепитьПатчПослеВопроса", ЭтотОбъект);
		КнопкиДаНет = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, КнопкиДаНет, , КодВозвратаДиалога.Да);
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуРучногоСозданияПатча();
	
КонецПроцедуры

&НаКлиенте
Процедура Пересоздать(Команда)
	ПересоздатьНаСервере();
	Оповестить("Патчи_ИзменениеСтатуса");
КонецПроцедуры

&НаСервере
Процедура ПересоздатьНаСервере()
	ПатчиСлужебный.ПересоздатьПатч(Запись);
	Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура ОпубликоватьПатч(Команда)
	ТекстВопроса = НСтр("ru = 'Повторить публикацию патча?'");
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПодтвердитьПубликациюПатча", ЭтотОбъект);
	КнопкиДаНет = РежимДиалогаВопрос.ДаНет;
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, КнопкиДаНет, , КодВозвратаДиалога.Да);
КонецПроцедуры

&НаКлиенте
Процедура ПрименимостьПатча(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПрименимостьПатчаЗавершение", ЭтотОбъект);
	
	ПараметрыРедактирования = Новый Структура;
	ПараметрыРедактирования.Вставить("Версия", Запись.Версия);
	ПараметрыРедактирования.Вставить("УникальныйИдентификатор", Запись.УникальныйИдентификатор);
	ПараметрыРедактирования.Вставить("Патч", Запись.Патч);
	ОткрытьФорму("РегистрСведений.ВерсииПатчей.Форма.РедактированиеПрименимости", ПараметрыРедактирования, , , , , ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьПрименимость(Команда)
	СостояниеДоОбновления = Запись.Состояние;
	Результат = ПересчетПрименимостиНаСервере();
	Если Результат = "Успешно" Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Применимость обновлена.'"));
	Иначе
		ПоказатьПредупреждение(, НСтр("ru = 'Не удалось обновить применимость.'"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтозватьПатч(Команда)
	ПараметрыОтзыва = Новый Структура;
	ПараметрыОтзыва.Вставить("Патч", Запись.Патч);
	ПараметрыОтзыва.Вставить("Версия", Запись.Версия);
	ПараметрыОтзыва.Вставить("УникальныйИдентификатор", Запись.УникальныйИдентификатор);
	ОбработчикЗавершения = Новый ОписаниеОповещения("ОтозватьВерсиюПатчаЗавершение", ЭтотОбъект);
	ОткрытьФорму("РегистрСведений.ВерсииПатчей.Форма.ОтзывПатча", ПараметрыОтзыва, , , , , ОбработчикЗавершения);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПодтвердитьПроверкуПатча(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> "ПатчПроверен" Тогда
		Возврат;
	КонецЕсли;
	ПодтвердитьКорректностьПатча();
	Оповестить("Патчи_ИзменениеСтатуса");
КонецПроцедуры

&НаСервере
Функция ИнформацияОПатче()
	ДанныеПатча = ПатчиСлужебный.ДвоичныеДанныеПатча(Запись.УникальныйИдентификатор);
	НомерПатча  = ПатчиСлужебный.НомерПатча(Запись.УникальныйИдентификатор);
	Результат = Новый Структура;
	Результат.Вставить("ДанныеПатча", ПоместитьВоВременноеХранилище(ДанныеПатча, УникальныйИдентификатор));
	Результат.Вставить("ИмяПатча", ПатчиСлужебный.ИмяПатча(Запись.Патч, НомерПатча));
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура ПодтвердитьКорректностьПатча()
	Если ВключенаПубликация Тогда
		ПатчиСлужебный.УстановитьСтатусПатча(Запись, Перечисления.СтатусыПатчей.ОжидаетПубликации);
	Иначе
		ПатчиСлужебный.УстановитьСтатусПатча(Запись, Перечисления.СтатусыПатчей.СозданПроверен);
	КонецЕсли;
	Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьПубликациюПатча(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	ОтметитьНеобходимостьПубликацииПатча();
	Оповестить("Патчи_ИзменениеСтатуса");
	Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура ОтозватьВерсиюПатчаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> "Успешно" Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьВерсиюПатчаВзаменОтозванной();
	
	Оповестить("Патчи_ИзменениеСтатуса");
	Прочитать();
КонецПроцедуры

&НаСервере
Процедура ДобавитьВерсиюПатчаВзаменОтозванной()
	ОшибкаОснование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Патч, "Ошибка");
	
	Если ТипЗнч(ОшибкаОснование) = Тип("СправочникСсылка.Ошибки") Тогда
		НеобходимыеСвойства = "Ссылка,ВерсияИсправления,Статус,Обнаружена,
			|СборкаОбнаружения,ДатаОбнаружения,ВерсияИсправления,ДатаИсправления,ВеткаОбнаружения";
		СвойстваОшибки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОшибкаОснование, НеобходимыеСвойства);
		ПатчиСлужебный.ДобавитьВерсииПатчаПоОшибке(Запись.Патч, СвойстваОшибки);
	Иначе
		ПатчиСлужебный.ДобавитьПатчНаКонкретнуюВерсию(Запись.Патч, Запись.Версия, Ложь);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОтметитьНеобходимостьПубликацииПатча()
	ПатчиСлужебный.УстановитьСтатусПатча(Запись, Перечисления.СтатусыПатчей.ОжидаетПубликации);
	Прочитать();
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьЭлементовФормы()
	
	Элементы.Подтвердить.Видимость = Ложь;
	Элементы.ФормаСохранитьПатч.Видимость = 
		Не (Запись.Состояние = Перечисления.СтатусыПатчей.ОжиданиеИсправления
		  Или Запись.Состояние = Перечисления.СтатусыПатчей.Ошибка
		  Или Запись.Состояние = Перечисления.СтатусыПатчей.СозданиеПатча
		  Или Запись.Состояние = Перечисления.СтатусыПатчей.СозданиеВручную);
	Элементы.ПрикрепитьПатч.Видимость = Запись.Состояние = Перечисления.СтатусыПатчей.Ошибка
		Или Запись.Состояние = Перечисления.СтатусыПатчей.ОжиданиеИсправления
		Или Запись.Состояние = Перечисления.СтатусыПатчей.СозданиеПатча
		Или Запись.Состояние = Перечисления.СтатусыПатчей.СозданиеВручную;
	
	ЕстьОшибки = (Запись.Состояние = Перечисления.СтатусыПатчей.Ошибка
		Или Запись.Состояние = Перечисления.СтатусыПатчей.ОшибкаПубликации);
	Элементы.ДекорацияСтатус.Видимость = ЕстьОшибки;
	
	ОтображатьПрименимость = ЗначениеЗаполнено(Запись.НачальнаяСборка) И ЗначениеЗаполнено(Запись.КонечнаяСборка);
	Элементы.НачальнаяДата.Видимость  = ОтображатьПрименимость;
	Элементы.КонечнаяСборка.Видимость = ОтображатьПрименимость;
	
	Проект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Ошибка, "Владелец");
	ЕстьПравоПубликации = УправлениеДоступомСППР.РольДоступнаПоПроекту("ПубликацияПатчей", Проект);
	Элементы.ОпубликоватьПатч.Видимость = ЕстьПравоПубликации
		И (Запись.Состояние = ПредопределенноеЗначение("Перечисление.СтатусыПатчей.ОшибкаПубликации"));
	
	Если Запись.Состояние = Перечисления.СтатусыПатчей.СозданНеПроверен
		Или Запись.Состояние = Перечисления.СтатусыПатчей.СозданПроверен
		Или Запись.Состояние = Перечисления.СтатусыПатчей.Опубликован Тогда
		Элементы.СтраницыСостояниеИПрименимость.ТекущаяСтраница = Элементы.СтраницаПрименимость;
	Иначе
		Элементы.СтраницыСостояниеИПрименимость.ТекущаяСтраница = Элементы.СтраницаСостояние;
	КонецЕсли;
	
	Элементы.ПересчитатьПрименимость.Видимость = (Запись.Состояние = Перечисления.СтатусыПатчей.Опубликован);
	
	Элементы.ОтозватьПатч.Видимость = (Запись.Состояние = Перечисления.СтатусыПатчей.Опубликован);
	
	Элементы.ПрикрепитьПатчДляУспешныхПатчей.Видимость = (Запись.Состояние = Перечисления.СтатусыПатчей.СозданНеПроверен)
		Или (Запись.Состояние = Перечисления.СтатусыПатчей.СозданПроверен);
	
	Если Элементы.Подтвердить.Видимость Или Элементы.ФормаСохранитьПатч.Видимость Тогда
		СтандартныеПодсистемыСервер.УстановитьКлючНазначенияФормы(ЭтотОбъект, "ПроверкаПатча");
	ИначеЕсли ЕстьОшибки Тогда
		СтандартныеПодсистемыСервер.УстановитьКлючНазначенияФормы(ЭтотОбъект, "ЕстьОшибки");
	ИначеЕсли Не ОтображатьПрименимость Тогда
		СтандартныеПодсистемыСервер.УстановитьКлючНазначенияФормы(ЭтотОбъект, "БезПолейПрименимости");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрименимостьПатчаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Прочитать();
КонецПроцедуры

&НаСервере
Функция ПересчетПрименимостиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("УникальныйИдентификатор", Запись.УникальныйИдентификатор);
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВерсииПатчей.Версия КАК Версия,
		|	ВерсииПатчей.Патч КАК Патч,
		|	ВерсииПатчей.НачальнаяСборка КАК НачальнаяСборка,
		|	ВерсииПатчей.КонечнаяСборка КАК КонечнаяСборка,
		|	ВерсииПатчей.ДанныеПатча КАК ДанныеПатча,
		|	ВерсииПатчей.ДатаИсправления КАК ДатаИсправления,
		|	ВерсииПатчей.УникальныйИдентификатор КАК УникальныйИдентификатор,
		|	ВерсииПатчей.Описание КАК Описание,
		|	ВерсииПатчей.ИзменяемыеМетаданные КАК ИзменяемыеМетаданные,
		|	ВерсииПатчей.Состояние КАК Состояние,
		|	ВерсииПатчей.Параметры КАК Параметры,
		|	ВерсииПатчей.ИдентификаторПубликации КАК ИдентификаторПубликации,
		|	Проекты.Библиотека КАК ЭтоБиблиотека,
		|	Проекты.ИмяКонфигурации КАК ИмяКонфигурации,
		|	Проекты.ИдентификаторПрограммы КАК ИдентификаторПрограммы,
		|	ВерсииПатчей.РежимСовместимости КАК РежимСовместимости,
		|	ВерсииПатчей.КонечнаяСборкаПоХранилищу КАК КонечнаяСборкаПоХранилищу
		|ИЗ
		|	РегистрСведений.ВерсииПатчей КАК ВерсииПатчей
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВерсииПроекта КАК ВерсииПроекта
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Проекты КАК Проекты
		|			ПО ВерсииПроекта.Владелец = Проекты.Ссылка
		|		ПО ВерсииПатчей.Версия = ВерсииПроекта.Ссылка
		|ГДЕ
		|	ВерсииПатчей.УникальныйИдентификатор = &УникальныйИдентификатор";
	УстановитьПривилегированныйРежим(Истина);
	ВерсияПатча = Запрос.Выполнить().Выгрузить()[0];
	ЭтоБазовая = СтрНайти(ВерсияПатча.ИмяКонфигурации, "Базовая") > 0;
	Результат = ПатчиСлужебный.ОбновлениеПрименимостиПатчаВСервисе(ВерсияПатча, ЭтоБазовая, ВерсияПатча.ИдентификаторПрограммы);
	УстановитьПривилегированныйРежим(Ложь);
	Прочитать();
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ПрикрепитьПатчПослеВопроса(Результат, ДополнительныеПараметры) Экспорт
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ВключитьРучноеСозданиеПатчаНаСервере();
	ОткрытьФормуРучногоСозданияПатча();
КонецПроцедуры

&НаСервере
Процедура ВключитьРучноеСозданиеПатчаНаСервере()
	ПатчиСлужебный.УстановитьСтатусПатча(Запись, Перечисления.СтатусыПатчей.СозданиеВручную);
	Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРучногоСозданияПатча()
	
	ПередаваемыеПараметры = Новый Структура;
	ПередаваемыеПараметры.Вставить("Патч", Запись.Патч);
	ПередаваемыеПараметры.Вставить("Версия", Запись.Версия);
	ПередаваемыеПараметры.Вставить("НачальнаяСборка", Запись.НачальнаяСборка);
	ПередаваемыеПараметры.Вставить("КонечнаяСборка",  Запись.КонечнаяСборка);
	ПередаваемыеПараметры.Вставить("ИдентификаторПатча",   Запись.УникальныйИдентификатор);
	ПередаваемыеПараметры.Вставить("ИзменяемыеМетаданные", Запись.ИзменяемыеМетаданные);
	ПередаваемыеПараметры.Вставить("Состояние", Запись.Состояние);
	
	ОткрытьФорму("РегистрСведений.ВерсииПатчей.Форма.РучноеСозданиеПатча", ПередаваемыеПараметры);
	
КонецПроцедуры

#КонецОбласти
